ВЫБРАТЬ
	ВТ_СуммыКоэффициентыВС_предв.ПенсионныйСчет КАК ПенсионныйСчет,
	ВТ_СуммыКоэффициентыВС_предв.ШаблонДоговора КАК ШаблонДоговора,
	ВТ_СуммыКоэффициентыВС_предв.Схема КАК Схема,
	ВТ_СуммыКоэффициентыВС_предв.ТипРезерва КАК ТипРезерва,
	ВТ_СуммыКоэффициентыВС_предв.ТипСуммы КАК ТипСуммы,
	ВТ_СуммыКоэффициентыВС_предв.ОстатокИсх КАК ОстатокИсх,
	ВТ_СуммыКоэффициентыВС_предв.ПриоритетРасчетаВС КАК ПриоритетРасчетаВС,
	ВТ_СуммыКоэффициентыВС_предв.КоэффициентВС КАК КоэффициентВС,
//+ЮП 07.04.25
//	МИНИМУМ(ВТ_СуммыКоэффициентыВС_предв.БудущееКоэффициентВС) КАК БудущееКоэффициентВС,
//	МИНИМУМ(ВТ_СуммыКоэффициентыВС_предв.БудущееНачалоПериода) КАК БудущееНачалоПериода,
	МАКСИМУМ(ВТ_СуммыКоэффициентыВС_предв.БудущееКоэффициентВС) КАК БудущееКоэффициентВС,
    МАКСИМУМ(ВТ_СуммыКоэффициентыВС_предв.БудущееНачалоПериода) КАК БудущееНачалоПериода,
//-ЮП 07.04.25	
    ВТ_СуммыКоэффициентыВС_предв.Состояние КАК Состояние,
	ВТ_СуммыКоэффициентыВС_предв.СостояниеДляРасчета КАК СостояниеДляРасчета, 
    ВТ_СуммыКоэффициентыВС_предв.КоличествоЛет КАК КоличествоЛет,
    ВТ_СуммыКоэффициентыВС_предв.ПериодРасчетаВС КАК ПериодРасчетаВС
ПОМЕСТИТЬ ВТ_СуммыКоэффициентыВС
ИЗ
	ВТ_СуммыКоэффициентыВС_предв КАК ВТ_СуммыКоэффициентыВС_предв
СГРУППИРОВАТЬ ПО
	ВТ_СуммыКоэффициентыВС_предв.ПенсионныйСчет,
	ВТ_СуммыКоэффициентыВС_предв.ШаблонДоговора,
	ВТ_СуммыКоэффициентыВС_предв.Схема,
	ВТ_СуммыКоэффициентыВС_предв.ТипРезерва,
	ВТ_СуммыКоэффициентыВС_предв.ТипСуммы,
	ВТ_СуммыКоэффициентыВС_предв.ОстатокИсх,
	ВТ_СуммыКоэффициентыВС_предв.ПриоритетРасчетаВС,
	ВТ_СуммыКоэффициентыВС_предв.КоэффициентВС,
    ВТ_СуммыКоэффициентыВС_предв.Состояние,
	ВТ_СуммыКоэффициентыВС_предв.СостояниеДляРасчета, 
    ВТ_СуммыКоэффициентыВС_предв.КоличествоЛет,
    ВТ_СуммыКоэффициентыВС_предв.ПериодРасчетаВС


;