////////////////////////////////////////////////////////////////////////////////
ВЫБРАТЬ
	уп_СостоянияПССрезПоследних.НомерСчета КАК ПенсионныйСчет,
	уп_СостоянияПССрезПоследних.Состояние КАК Состояние,
	уп_СостоянияПССрезПоследних.Период КАК Период,
	уп_СостоянияПССрезПоследних.Расшифровка КАК Расшифровка,
	ВЫБОР
		КОГДА ЕСТЬNULL(уп_СостоянияПССрезПервыхНакопительный.Период, ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)) > &КонецПериода
			ТОГДА ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		ИНАЧЕ ЕСТЬNULL(уп_СостоянияПССрезПервыхНакопительный.Период, ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0))
	КОНЕЦ КАК ДатаНакопительногоПериода,
	ВЫБОР
		КОГДА ЕСТЬNULL(уп_СостоянияПССрезПервыхВыплатной.Период, ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)) > &КонецПериода
			ТОГДА ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		ИНАЧЕ ЕСТЬNULL(уп_СостоянияПССрезПервыхВыплатной.Период, ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0))
	КОНЕЦ КАК ДатаВыплатногоПериода
ПОМЕСТИТЬ ВТ_СостоянияПенсионныхСчетов
ИЗ
	РегистрСведений.уп_СостоянияПС.СрезПоследних(
			&КонецПериода,
			НомерСчета В
				(ВЫБРАТЬ
					ВТ_ПенсионныеСчета.ПенсионныйСчет
				ИЗ
					ВТ_ПенсионныеСчета КАК ВТ_ПенсионныеСчета)) КАК уп_СостоянияПССрезПоследних
		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уп_СостоянияПС.СрезПервых(, Состояние = ЗНАЧЕНИЕ(Перечисление.уп_СостоянияПС.НакопительныйПериод)) КАК уп_СостоянияПССрезПервыхНакопительный
		ПО уп_СостоянияПССрезПоследних.НомерСчета = уп_СостоянияПССрезПервыхНакопительный.НомерСчета
		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уп_СостоянияПС.СрезПервых(, Состояние В (ЗНАЧЕНИЕ(Перечисление.уп_СостоянияПС.ВыплатнойПериод), ЗНАЧЕНИЕ(Перечисление.уп_СостоянияПС.НачисленияПриостановлены), ЗНАЧЕНИЕ(Перечисление.уп_СостоянияПС.ВыплатыПриостановлены))) КАК уп_СостоянияПССрезПервыхВыплатной
		ПО уп_СостоянияПССрезПоследних.НомерСчета = уп_СостоянияПССрезПервыхВыплатной.НомерСчета

ИНДЕКСИРОВАТЬ ПО
	ПенсионныйСчет