
ВЫБРАТЬ
	ВЫБОР
		КОГДА &ИСПОЛЬЗОВАТЬДЛЯНПО = 1                                
			ТОГДА ИСТИНА
		ИНАЧЕ ЛОЖЬ
	КОНЕЦ КАК Поле1
ПОМЕСТИТЬ ВТ_ИСПОЛЬЗОВАТЬДЛЯНПО
;

ВЫБРАТЬ
	ЗНАЧЕНИЕ(Перечисление.уп_ТипыРезерва.ИПС) КАК ТипРезерва
ПОМЕСТИТЬ ВТ_ТипыРезервов

ОБЪЕДИНИТЬ ВСЕ

ВЫБРАТЬ
	ЗНАЧЕНИЕ(Перечисление.уп_ТипыРезерва.СПС)

ОБЪЕДИНИТЬ ВСЕ

ВЫБРАТЬ
	ЗНАЧЕНИЕ(Перечисление.уп_ТипыРезерва.РезервНачисленийПенсийИПС)

ОБЪЕДИНИТЬ ВСЕ

ВЫБРАТЬ
	ЗНАЧЕНИЕ(Перечисление.уп_ТипыРезерва.РезервНачисленийПенсийСПС)

ОБЪЕДИНИТЬ ВСЕ

ВЫБРАТЬ
	ЗНАЧЕНИЕ(Перечисление.уп_ТипыРезерва.РезервНачисленийВыкупныхСуммИПС)

ОБЪЕДИНИТЬ ВСЕ

ВЫБРАТЬ
	ЗНАЧЕНИЕ(Перечисление.уп_ТипыРезерва.РезервНачисленийВыкупныхСуммСПС)

ОБЪЕДИНИТЬ ВСЕ

ВЫБРАТЬ
	ЗНАЧЕНИЕ(Перечисление.уп_ТипыРезерва.ПожизненныхВыплат)

ОБЪЕДИНИТЬ ВСЕ

ВЫБРАТЬ
	ЗНАЧЕНИЕ(Перечисление.уп_ТипыРезерва.РПАР)

ОБЪЕДИНИТЬ ВСЕ

ВЫБРАТЬ
	ЗНАЧЕНИЕ(Перечисление.уп_ТипыРезерва.РезервНачисленийПенсийПожизненныхВыплат)

ОБЪЕДИНИТЬ ВСЕ

ВЫБРАТЬ
	ЗНАЧЕНИЕ(Перечисление.уп_ТипыРезерва.РезервНачисленийВыкупныхСуммПожизненныхВыплат)

ОБЪЕДИНИТЬ ВСЕ

ВЫБРАТЬ
	ЗНАЧЕНИЕ(Перечисление.уп_ТипыРезерва.РезервНачисленийНаследниковИПС)

ОБЪЕДИНИТЬ ВСЕ

ВЫБРАТЬ
	ЗНАЧЕНИЕ(Перечисление.уп_ТипыРезерва.РезервНачисленийНаследниковСПС)

ОБЪЕДИНИТЬ ВСЕ

ВЫБРАТЬ
	ЗНАЧЕНИЕ(Перечисление.уп_ТипыРезерва.РезервНаследниковИПС)

ОБЪЕДИНИТЬ ВСЕ

ВЫБРАТЬ
	ЗНАЧЕНИЕ(Перечисление.уп_ТипыРезерва.РезервНаследниковСПС)
;

////////////////////////////////////////////////////////////////////////////////
ВЫБРАТЬ
	ВидыДокументовФизическихЛиц.Ссылка КАК ВидДокумента
ПОМЕСТИТЬ ВТ_ВидыПаспортов
ИЗ
	Справочник.ВидыДокументовФизическихЛиц КАК ВидыДокументовФизическихЛиц
ГДЕ
	ВидыДокументовФизическихЛиц.ИмяПредопределенныхДанных <> ""
;

////////////////////////////////////////////////////////////////////////////////
ВЫБРАТЬ
	уп_ОперацияНПО.Ссылка КАК ДокументСторно
ПОМЕСТИТЬ ВТ_ДокументыСторно
ИЗ
	Документ.уп_ОперацияНПО КАК уп_ОперацияНПО
ГДЕ
	уп_ОперацияНПО.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	И уп_ОперацияНПО.СпособЗаполнения = "Сторно"
	И уп_ОперацияНПО.Организация В(&Организация)

ОБЪЕДИНИТЬ ВСЕ

ВЫБРАТЬ
	уп_ВозвратПенсий.Ссылка
ИЗ
	Документ.уп_ВозвратПенсий КАК уп_ВозвратПенсий
ГДЕ
	уп_ВозвратПенсий.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	И уп_ВозвратПенсий.Организация В(&Организация)

ОБЪЕДИНИТЬ ВСЕ

ВЫБРАТЬ
	уп_ВозвратПрочихНачисленийНПО.Ссылка
ИЗ
	Документ.уп_ВозвратПрочихНачисленийНПО КАК уп_ВозвратПрочихНачисленийНПО
ГДЕ
	уп_ВозвратПрочихНачисленийНПО.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	И уп_ВозвратПрочихНачисленийНПО.Организация В(&Организация)

ОБЪЕДИНИТЬ ВСЕ

ВЫБРАТЬ
	ДанныеДокумента.Ссылка
ИЗ
	Документ.уп_НДФЛВозвратНалогаУчастникам КАК ДанныеДокумента
ГДЕ
	ДанныеДокумента.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	И ДанныеДокумента.Организация В(&Организация)
;

ВЫБРАТЬ
	ВидыДвижений.Ссылка КАК Ссылка
ПОМЕСТИТЬ ВТ_ПереводыИзРегистров_ВидыДвижений
ИЗ
	Перечисление.епс_ВидыДвиженияПенсионныхРезервов КАК ВидыДвижений
ГДЕ
//+ЮП 21.04.25
	ВидыДвижений.Ссылка В (ЗНАЧЕНИЕ(Перечисление.епс_ВидыДвиженияПенсионныхРезервов.ПереводыС_СПС_На_ИПС),
							ЗНАЧЕНИЕ(Перечисление.епс_ВидыДвиженияПенсионныхРезервов.ПереводыС_ИПС_На_СПС),
							ЗНАЧЕНИЕ(Перечисление.епс_ВидыДвиженияПенсионныхРезервов.ПереводыС_ИПС_На_ИПС),
							ЗНАЧЕНИЕ(Перечисление.епс_ВидыДвиженияПенсионныхРезервов.ПереводыС_СПС_в_РПАР),
							ЗНАЧЕНИЕ(Перечисление.епс_ВидыДвиженияПенсионныхРезервов.ПереводыС_ИПС_в_РПАР)) 
//-ЮП 21.04.25
;

////////////////////////////////////////////////////////////////////////////////
ВЫБРАТЬ
	ВидыДвижений.Ссылка КАК Ссылка
ПОМЕСТИТЬ ВТ_ПереводыИзРегистров_ВидыДвижений_ВРезервы
ИЗ
	Перечисление.епс_ВидыДвиженияПенсионныхРезервов КАК ВидыДвижений
ГДЕ
//+ЮП 22.04.25
	ВидыДвижений.Ссылка В (ЗНАЧЕНИЕ(Перечисление.епс_ВидыДвиженияПенсионныхРезервов.ПереводыС_ИПС_В_Страховой),
							ЗНАЧЕНИЕ(Перечисление.епс_ВидыДвиженияПенсионныхРезервов.ПереводыС_СПС_В_Страховой),
							ЗНАЧЕНИЕ(Перечисление.епс_ВидыДвиженияПенсионныхРезервов.ПереводыС_ИПС_В_РПВ),
							ЗНАЧЕНИЕ(Перечисление.епс_ВидыДвиженияПенсионныхРезервов.ПереводыИз_Страхового_На_ИПС),
							ЗНАЧЕНИЕ(Перечисление.епс_ВидыДвиженияПенсионныхРезервов.ПереводыИз_Страхового_На_СПС),
							ЗНАЧЕНИЕ(Перечисление.епс_ВидыДвиженияПенсионныхРезервов.ПереводыИз_Страхового_В_РПВ),
//+ЮП 22.07.2025							
							ЗНАЧЕНИЕ(Перечисление.епс_ВидыДвиженияПенсионныхРезервов.ИныеПереводыМеждуСчетами)
//-ЮП 22.07.2025							
							)
//-ЮП 22.04.25

;

////////////////////////////////////////////////////////////////////////////////
ВЫБРАТЬ
	Подзапрос.ПенсионныйСчет КАК ПенсионныйСчет
ПОМЕСТИТЬ ВТ_ПенсионныеСчета_ПР
ИЗ
	(ВЫБРАТЬ
		уп_РезервыОстатки.НомерСчета КАК ПенсионныйСчет
	ИЗ
		РегистрНакопления.уп_Резервы.Остатки(
				&НачалоПериода,
				Организация В (&Организация)
					И ТипРезерва В
						(ВЫБРАТЬ
							ВТ_ТипыРезервов.ТипРезерва
						ИЗ
							ВТ_ТипыРезервов КАК ВТ_ТипыРезервов)) КАК уп_РезервыОстатки
	
	ОБЪЕДИНИТЬ
	
	ВЫБРАТЬ
		уп_РезервыОбороты.НомерСчета
	ИЗ
		РегистрНакопления.уп_Резервы.Обороты(
				&НачалоПериода,
				&КонецПериода,
				,
				Организация В (&Организация)
					И ТипРезерва В
						(ВЫБРАТЬ
							ВТ_ТипыРезервов.ТипРезерва
						ИЗ
							ВТ_ТипыРезервов КАК ВТ_ТипыРезервов)) КАК уп_РезервыОбороты

//++ 09.10.2025 добавили ПС, у которых были возвраты, не отраженные в РН Резервы ПДС
	ОБЪЕДИНИТЬ

	ВЫБРАТЬ
		уп_ВозвратыПрочихНачисленийНПООстатки.НомерСчета КАК ПенсионныйСчет
	ИЗ
		РегистрНакопления.уп_ВозвратыПрочихНачисленийНПО.Остатки(
				&НачалоПериода,
				Организация В (&Организация)
					И ТипРезерва В
						(ВЫБРАТЬ
							ВТ_ТипыРезервов.ТипРезерва
						ИЗ
							ВТ_ТипыРезервов КАК ВТ_ТипыРезервов)) КАК уп_ВозвратыПрочихНачисленийНПООстатки
	
	ОБЪЕДИНИТЬ
	
	ВЫБРАТЬ
		уп_ВозвратыПрочихНачисленийНПООбороты.НомерСчета
	ИЗ
		РегистрНакопления.уп_ВозвратыПрочихНачисленийНПО.Обороты(
				&НачалоПериода,
				&КонецПериода,
				,
				Организация В (&Организация)
					И ТипРезерва В
						(ВЫБРАТЬ
							ВТ_ТипыРезервов.ТипРезерва
						ИЗ
							ВТ_ТипыРезервов КАК ВТ_ТипыРезервов)) КАК уп_ВозвратыПрочихНачисленийНПООбороты
							
	ОБЪЕДИНИТЬ

	ВЫБРАТЬ
		уп_ВозвратыПенсийНПООстатки.НомерСчета КАК ПенсионныйСчет
	ИЗ
		РегистрНакопления.уп_ВозвратыПенсийНПО.Остатки(
				&НачалоПериода,
				Организация В (&Организация)
					И ТипРезерва В
						(ВЫБРАТЬ
							ВТ_ТипыРезервов.ТипРезерва
						ИЗ
							ВТ_ТипыРезервов КАК ВТ_ТипыРезервов)) КАК уп_ВозвратыПенсийНПООстатки
	
	ОБЪЕДИНИТЬ
	
	ВЫБРАТЬ
		уп_ВозвратыПенсийНПООбороты.НомерСчета
	ИЗ
		РегистрНакопления.уп_ВозвратыПенсийНПО.Обороты(
				&НачалоПериода,
				&КонецПериода,
				,
				Организация В (&Организация)
					И ТипРезерва В
						(ВЫБРАТЬ
							ВТ_ТипыРезервов.ТипРезерва
						ИЗ
							ВТ_ТипыРезервов КАК ВТ_ТипыРезервов)) КАК уп_ВозвратыПенсийНПООбороты
//-- 09.10.2025
	
	ОБЪЕДИНИТЬ
	
	ВЫБРАТЬ
		уп_НачисленияПенсийОбороты.НомерСчета
	ИЗ
		РегистрНакопления.уп_НачисленияПенсий.Обороты(&НачалоПериода, &КонецПериода, , НомерСчета.Владелец.Организация В (&Организация)) КАК уп_НачисленияПенсийОбороты
	
	ОБЪЕДИНИТЬ
	
	ВЫБРАТЬ РАЗЛИЧНЫЕ
		уп_ПрочиеНачисленияОбороты.НомерСчета
	ИЗ
		РегистрНакопления.уп_ПрочиеНачисления.Обороты(&НачалоПериода, &КонецПериода, , Организация В (&Организация)) КАК уп_ПрочиеНачисленияОбороты
	
	ОБЪЕДИНИТЬ
	
	ВЫБРАТЬ
		уп_СостоянияДоговораСрезПоследних.ПенсионныйДоговор.ПенсионныйСчет
	ИЗ
		РегистрСведений.уп_СостоянияДоговора.СрезПоследних(&КонецПериода, ПенсионныйДоговор.Организация В (&Организация)) КАК уп_СостоянияДоговораСрезПоследних
	ГДЕ
		уп_СостоянияДоговораСрезПоследних.Состояние В (ЗНАЧЕНИЕ(Перечисление.уп_СостоянияДоговора.Действует))
	
	ОБЪЕДИНИТЬ
	
	ВЫБРАТЬ
		СостоянияПС.НомерСчета
	ИЗ
		РегистрСведений.уп_СостоянияПС.СрезПоследних(&КонецПериода, НомерСчета.Владелец.Организация В (&Организация)) КАК СостоянияПС
	ГДЕ
		СостоянияПС.Состояние В (ЗНАЧЕНИЕ(Перечисление.уп_СостоянияПС.НакопительныйПериод), ЗНАЧЕНИЕ(Перечисление.уп_СостоянияПС.ВыплатнойПериод), ЗНАЧЕНИЕ(Перечисление.уп_СостоянияПС.НачисленияПриостановлены), ЗНАЧЕНИЕ(Перечисление.уп_СостоянияПС.ВыплатыПриостановлены), ЗНАЧЕНИЕ(Перечисление.уп_СостоянияПС.ПодготовкаКЗакрытию))
	
	ОБЪЕДИНИТЬ
	
	ВЫБРАТЬ
		уп_СостоянияПС.НомерСчета
	ИЗ
		РегистрСведений.уп_СостоянияПС КАК уп_СостоянияПС
	ГДЕ
		уп_СостоянияПС.Период МЕЖДУ &НачалоПериода И &КонецПериода
		И уп_СостоянияПС.НомерСчета.Владелец.Организация В(&Организация)
		И уп_СостоянияПС.Состояние <> ЗНАЧЕНИЕ(Перечисление.уп_СостоянияПС.ОжиданиеВзносов)) КАК Подзапрос
ГДЕ
	ИСТИНА 
	И Подзапрос.ПенсионныйСчет.Владелец.ДатаЗаключения МЕЖДУ &ДАТАЗАКЛЮЧЕНИЯНАЧАЛО И &ДАТАЗАКЛЮЧЕНИЯКОНЕЦ
	//И Подзапрос.ПенсионныйСчет = &ПенсионныйСчет

ИНДЕКСИРОВАТЬ ПО
	Подзапрос.ПенсионныйСчет