ВЫБРАТЬ
    ВТ_ОстаткиТранзитныеВиды.ПенсионныйСчет КАК ПенсионныйСчет,
    ВТ_ОстаткиТранзитныеВиды.ВидОбязательств КАК ВидОбязательств,
    ВТ_ОстаткиТранзитныеВиды.ДатаОпределенияОбязательств КАК ДатаОпределенияОбязательств,
    ВТ_ОстаткиТранзитныеВиды.ДатаОкончанияОбязательств КАК ДатаОкончанияОбязательств,
    ВТ_ОстаткиТранзитныеВиды.ВхСумма КАК ОстатокВх,
    ВТ_ОстаткиТранзитныеВиды.ИсхСумма КАК ОстатокИсх,
    0 КАК Взносы,
    0 КАК ИнвестиционныйДоход,
    ЛОЖЬ КАК ПризнакИсхОстатка,
    0 КАК ЗадолженностьПенсии,
    0 КАК ИнвестДоходКФиксации
ИЗ
    ВТ_ОстаткиТранзитныеВиды КАК ВТ_ОстаткиТранзитныеВиды;