ВЫБРАТЬ
    уп_ЗаявлениеЗЛОЕдиновременнойВыплате.Ссылка КАК Ссылка,
    уп_ЗаявлениеЗЛОЕдиновременнойВыплате.Участник КАК Получатель,
    уп_ЗаявлениеЗЛОЕдиновременнойВыплате.ДоговорОПС КАК ДоговорОПС
ПОМЕСТИТЬ ЗЛО
ИЗ
    Документ.уп_ЗаявлениеЗЛОЕдиновременнойВыплате КАК уп_ЗаявлениеЗЛОЕдиновременнойВыплате

ОБЪЕДИНИТЬ ВСЕ

ВЫБРАТЬ
    уп_ЗаявлениеЗЛОНазначенииНЧТП.Ссылка КАК Ссылка,
    уп_ЗаявлениеЗЛОНазначенииНЧТП.Получатель КАК Получатель,
    уп_ЗаявлениеЗЛОНазначенииНЧТП.ДоговорОПС КАК ДоговорОПС
ИЗ
    Документ.уп_ЗаявлениеЗЛОНазначенииНЧТП КАК уп_ЗаявлениеЗЛОНазначенииНЧТП

ОБЪЕДИНИТЬ ВСЕ

ВЫБРАТЬ
    уп_ЗаявлениеЗЛОНазначенииСрочнойВыплаты.Ссылка КАК Ссылка,
    уп_ЗаявлениеЗЛОНазначенииСрочнойВыплаты.Получатель КАК Получатель,
    уп_ЗаявлениеЗЛОНазначенииСрочнойВыплаты.ДоговорОПС КАК ДоговорОПС
ИЗ
    Документ.уп_ЗаявлениеЗЛОНазначенииСрочнойВыплаты КАК уп_ЗаявлениеЗЛОНазначенииСрочнойВыплаты;