-- node_id: 89
-- name: ВТ_ВозвратыПенсий
-- type: temp_query
ВЫБРАТЬ
	ВТ_ПенсионныеСчета.ПенсионныйСчет КАК ПенсионныйСчет,
	уп_Резервы.Сумма КАК Сумма
ПОМЕСТИТЬ ВТ_ВозвратыПенсий
ИЗ
	ВТ_ПенсионныеСчета КАК ВТ_ПенсионныеСчета
		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.уп_Резервы КАК уп_Резервы
		ПО ВТ_ПенсионныеСчета.ПенсионныйСчет = уп_Резервы.НомерСчета
ГДЕ
	уп_Резервы.Период МЕЖДУ &НачалоПериода И &КонецПериода
	И уп_Резервы.Регистратор ССЫЛКА Документ.уп_ВозвратПенсий
	И уп_Резервы.Организация В(&Организация)
	И уп_Резервы.ТипРезерва В
			(ВЫБРАТЬ
				ВТ_ТипыРезервов.ТипРезерва
			ИЗ
				ВТ_ТипыРезервов КАК ВТ_ТипыРезервов)
	И уп_Резервы.Движение = ЗНАЧЕНИЕ(Перечисление.уп_ВидыДвижений.Возврат)
	И уп_Резервы.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)

ИНДЕКСИРОВАТЬ ПО
	ПенсионныйСчет
